Repository: Drim8Sam/MultiLanguagesApp
Catalog: MultiLanguages/MultiLanguages/Resources/Resource.*.resx
Languages: es, ru

source: Home
es: Inicio
ru: Главная

# Privacy
source: About App
es: Acerca de la aplicación Gion
ru: О Приложении

source: Home Page
es: Página de inicio
ru: Главная страница

# Welcome
source: Welcome to MultiLanguages App!
es: ¡Bienvenido a la aplicación MultiLanguages!
ru: Добро пожаловать в приложение MultiLanguages!

# LearnAbout
source: Learn about building multilingual web apps with ASP.NET Core.
es: Aprenda sobre cómo construir aplicaciones web multilingües con ASP.NET Core.
ru: Узнайте, как создавать многоязычные веб-приложения с ASP.NET Core.

source: Building Web Apps
es: Creación de aplicaciones web
ru: Создание веб-приложений

# PrivacyPolicy
source: About App
es: Política de privacidad
ru: О приложении

# LocalTime
source: Local time of this region
es: Hora local de esta región
ru: Локальное время этого региона

# CurrencyText
source: Currency of this region
es: Moneda de esta región
ru: Валюта этого региона

# ApplicationDescriptionTitle
source: Application Description
es: Descripción de la aplicación
ru: Описание приложения

# ApplicationDescription
source: This web application demonstrates the implementation of a multilingual interface with support for localization and globalization for different languages and regional settings. The application is built on the ASP.NET Core platform and is designed for users who work in different languages (English, Russian and Spanish), with the ability to switch interface languages and adapt the displayed data to the cultural specificities of the selected region.
es: Esta aplicación web demuestra la implementación de una interfaz multilingüe con soporte para localización y globalización para varios idiomas y configuraciones regionales. La aplicación está construida sobre la plataforma ASP.NET Core y está destinada a usuarios que trabajan en diferentes idiomas (inglés, ruso y español), con la capacidad de cambiar el idioma de la interfaz y adaptar los datos mostrados a las características culturales de la región seleccionada..
ru: Данное веб-приложение демонстрирует реализацию многоязычного интерфейса с поддержкой локализации и глобализации для различных языков и региональных настроек. Приложение построено на платформе ASP.NET Core и предназначено для пользователей, которые работают на разных языках (английском, русском и испанском), с возможностью переключения языков интерфейса и адаптации отображаемых данных под культурные особенности выбранного региона.

# ApplicationFeaturesTitle
source: Key Features
es: Funciones principales
ru: Основные возможности

# LocalizationFeature
source: Localized user interface with support for English, Russian, and Spanish
es: Interfaz de usuario localizada con soporte para inglés, ruso y español
ru: Локализованный интерфейс с поддержкой английского, русского и испанского языков

# GlobalizationFeature
source: Automatic formatting of dates, times, numbers, and currency based on the selected culture
es: Formato automático de fechas, horas, números y monedas según la cultura seleccionada
ru: Автоматическое форматирование дат, времени, чисел и валюты в зависимости от культуры

# TimeZoneFeature
source: Localized time zone display for user convenience
es: Visualización de zona horaria localizada
ru: Локализованное отображение часового пояса

# TechnologyTitle
source: Technologies Used
es: Tecnologías utilizadas
ru: Используемые технологии

# ASPNetDescription
source: Used for creating multilingual web pages with localization and globalization support
es: Para crear páginas web multilingües con soporte de localización y globalización
ru: Для создания многоязычных страниц с поддержкой локализации и глобализации

# JavaScriptDescription
source: Used to dynamically update local time
es: Para actualizar la hora local dinámicamente
ru: Для динамического обновления времени

# ResxDescription
source: Used to manage multi-language interface texts
es: Para gestionar textos de interfaz en varios idiomas
ru: Для управления многоязычными текстами интерфейса

# CultureInfoDescription
source: Used for handling cultural formats including date, time, number formatting, and currency
es: Para manejar formatos culturales, incluyendo fecha, hora y moneda
ru: Для обработки культурных форматов, включая даты, время и валюту

# PracticalImportanceTitle
source: Practical Importance
es: Importancia práctica
ru: Практическое значение

# PracticalImportance
source: This application is a tutorial example illustrating the process of adding localization and globalization to ASP.NET web applications. Such functionality is in demand in real-world applications where users may be from different countries, with different languages and cultural backgrounds, which requires flexibility of the interface and adaptation of the displayed data.
es: Esta aplicación es un tutorial que ilustra el proceso de agregar localización y globalización a aplicaciones web ASP.NET. Esta funcionalidad tiene demanda en aplicaciones reales, donde los usuarios pueden ser de diferentes países, con diferentes idiomas y características culturales, lo que requiere flexibilidad de interfaz y adaptación de los datos mostrados..
ru: Это приложение является учебным примером, иллюстрирующим процесс добавления локализации и глобализации в веб-приложения на ASP.NET. Подобная функциональность востребована в реальных приложениях, где пользователи могут быть из разных стран, с разными языками и культурными особенностями, что требует гибкости интерфейса и адаптации отображаемых данных.
